<html>
	<head>
		<title>HTML Online Editor Sample</title>
	</head>
	<body>
		<h1>
			<span style="color:#008080;">Nowy algorytm</span></h1>
		<p>
			Jest to kreator pozwalaj¹cy na utworzenie algorytmu genetycznego.&nbsp;</p>
		<h2>
			Specyfikacje</h2>
		<p>
			Specyfikacje okreœlaj¹ cechy k&oacute;³ oraz karoserii pojazdu. Trzy cechy okreœlaj¹ materia³, z jakiego zbudowane s¹ poszczeg&oacute;lne czêœci, w nawiasie podano dopuszczalne wartoœci</p>
		<ul>
			<li>
				<strong>Gêstoœæ [0.1; 10] </strong>Jest to gêstoœæ k&oacute;³ oraz segment&oacute;w karoserii, wy¿sza gêstoœæ oznacza wiêksz¹ masê.</li>
			<li>
				<strong>Tarcie [0; 1]</strong> Jest to tarcie karoserii oraz k&oacute;³ o pod³o¿e, wartoœæ 0 oznacza, ¿e tarcie w og&oacute;le nie wystêpuje, natomiast przy 1 jest maksymalnie du¿e.</li>
			<li>
				<strong>Sprê¿ystoœæ [0; 1]</strong> Sprê¿ystoœæ okreœla zachowanie karoserii oraz k&oacute;³ podczas kontaktu z pod³o¿em. W celu jego wyjaœnienia rozwa¿my przyk³ad z rzutem pi³k¹ o pod³ogê. Ustawienie wartoœci 0 spowoduje, ¿e pi³ka przy kontakcie z pod³og¹ pozostanie w bezruchu (zderzenie doskonale niesprê¿yste), natomiast ustawienie wartoœci 1 spowoduje, ¿e pi³ka odbije siê i wr&oacute;ci w przeciwn¹ stronê z tak¹ sam¹ prêdkoœci¹ (zdarzenie doskonale sprê¿yste).</li>
		</ul>
		<p>
			A cechy samych k&oacute;³ oraz segment&oacute;w karoserii okreœla:</p>
		<ul>
			<li>
				<strong>Liczba segment&oacute;w [3; 20]</strong> Bêd¹ca liczb¹ segment&oacute;w karoserii z kt&oacute;rych sk³ada siê ka¿dy z pojazd&oacute;w.</li>
			<li>
				<strong>Liczba k&oacute;³ [3; 20]</strong> Jest liczb¹ k&oacute;³, kt&oacute;re posiada ka¿dy pojazd. Dodatkowym ograniczeniem jest fakt, ¿e liczba ta nie mo¿e przekraczaæ liczby segment&oacute;w karoserii.</li>
			<li>
				<strong>D³ugoœæ segmentu [0.1; 2]</strong> Jest to d³ugoœæ poszczeg&oacute;lnego segmentu karoserii, liczona od œrodku pojazdu, do jego najbardziej wysuniêtego punktu.</li>
			<li>
				<strong>Promieñ ko³a [0.1; 0.5]</strong> Jest to promieñ ko³a pojazdu.</li>
		</ul>
		<p>
			Wszystkie wartoœci podawane s¹ jako maksimum oraz minimum. Powsta³y w ten spos&oacute;b zakres u¿ywany jest przy generowaniu losowych osobnik&oacute;w, ale tak¿e przy pracy algorytmu, podczas mutacji. Je¿eli promieñ ko³a zostanie ustalony na [0.2 - 0.25], to mutacja nie spowoduje powstania osobnik&oacute;w, kt&oacute;rych ko³a s¹ wiêksze lub mniejsze.</p>
		<h2>
			Utworzenie populacji</h2>
		<p>
			Populacje mo¿na tworzyæ na dwa sposoby:</p>
		<ol>
			<li>
				Wygenerowanie losowej populacji, opcja ta wymaga uprzedniego wype³nienia specyfikacji, na jej podstawie zostanie wygenerowana populacja losowa.&nbsp;</li>
			<li>
				Wczytanie istniej¹cej populacji. Je¿eli zaznaczona jest opcja Wype³nij specyfikacje, to wczytanie istniej¹cej populacji spowoduje automatyczne wype³nienie specyfikacji w oparciu o ca³¹ populacjê, zar&oacute;wno osobnik&oacute;w ju¿ w niej bêd¹cych, jak i dopiero dodanych.</li>
		</ol>
		<p>
			Nie ma przeszk&oacute;d w ³¹czeniu obu tych metod, tzn. czêœæ osobnik&oacute;w mo¿e byæ wczytana, nawet z r&oacute;¿nych populacji, a czêœæ wygenerowana losowo.</p>
		<h2>
			Zapisywanie populacji</h2>
		<p>
			Przycisk zapisz pozwala na zapisanie ca³ej istniej¹cej populacji do pliku.&nbsp;</p>
		<p>
			Mo¿na zapisaæ poszczeg&oacute;lnych osobnik&oacute;w, zaznaczaj¹c ich na liœcie (zaznaczenie wielu osobnik&oacute;w nale¿y wykonywaæ trzymaj¹c przycisk shift lub ctrl), a nastêpnie otworzyæ menu kontekstowe prawym przyciskiem myszy i wybraæ opcjê Zapisz.</p>
		<h2>
			Ustawienia</h2>
		<p>
			Ustawienia pozwalaj¹ okreœliæ w jaki spos&oacute;b algorytm genetyczny bêdzie dzia³aæ, sk³adaj¹ siê na nie nastêpuj¹ce opcje.</p>
		<p>
			&nbsp;</p>
		<ul>
			<li>
				<strong>Prawdopodobieñstwo krzy¿owania [0; 100]</strong> okreœla jaki procent populacji (statystycznie) weŸmie udzia³ w krzy¿owaniu, dla wartoœci 0 ¿aden osobnik nigdy nie bêdzie krzy¿owany, natomiast dla wartoœci 100 ca³a populacja zostanie poddana krzy¿owaniu. Domyœlna wartoœæ, czyli 75, oznacza, ¿e statystycznie 75% osobnik&oacute;w weŸmie udzia³ w reprodukcji, a 25% przejdzie do kolejnego etapu bez zmian, przynajmniej podczas krzy¿owania, gdy¿ nadal mog¹ ulec zmianie podczas mutacji.</li>
			<li>
				<strong>Metoda krzy¿owania</strong> okreœla w jaki spos&oacute;b osobnik bêdzie krzy¿owany, do wyboru s¹ trzy sposoby:
				<ul>
					<li>
						<strong>Metoda wymieniaj¹ca</strong>, w kt&oacute;rej geny rodzic&oacute;w bêd¹ ze sob¹ losowo wymieniane, na przyk³ad dla fragmentu gen&oacute;w rodzic&oacute;w [<span style="color:#ff0000;">1</span>,<span style="color:#ff0000;">2</span>,<span style="color:#ff0000;">1</span>] oraz [<span style="color:#00ff00;">3</span>,<span style="color:#00ff00;">3</span>,<span style="color:#00ff00;">3</span>] przyk³adowe potomstwo to [<span style="color:#ff0000;">1</span>,<span style="color:#00ff00;">3</span>,<span style="color:#ff0000;">1</span>] oraz [<span style="color:#00ff00;">3</span>,<span style="color:#ff0000;">2</span>,<span style="color:#00ff00;">3</span>]. Je¿eli jedno z dzieci dostanie materia³ genetyczny od rodzica pierwszego, to drugie automatycznie ma przydzielony od rodzica drugiego, zapobiega to utracie gen&oacute;w.</li>
					<li>
						<strong>Metoda uœredniaj¹ca</strong>, potomstwo rodzic&oacute;w&nbsp;[<span style="color: rgb(255, 0, 0);">1</span>,<span style="color: rgb(255, 0, 0);">2</span>,<span style="color: rgb(255, 0, 0);">1</span>] oraz&nbsp;[<span style="color: rgb(0, 255, 0);">3</span>,<span style="color: rgb(0, 255, 0);">3</span>,<span style="color: rgb(0, 255, 0);">3</span>] bêdzie posiadaæ uœrednione ceny, tzn. dzieæmi bêd¹ 2 identyczne osobniki&nbsp;[(<span style="color: rgb(255, 0, 0);">1</span><span style="color:#000000;">+</span><span style="color:#00ff00;">3</span>)/2,(<span style="color: rgb(255, 0, 0);">2</span><span style="color:#000000;">+</span><span style="color:#00ff00;">3</span>)/2,(<span style="color: rgb(255, 0, 0);">1</span><span style="color:#000000;">+</span><span style="color:#00ff00;">3</span><span style="color:#000000;">)/2</span>] = [<span style="color:#ee82ee;">2</span>; <span style="color:#ee82ee;">2.5</span>; <span style="color:#ee82ee;">2</span>]. Metoda ta traci pewne geny, ale jednoczeœnie powoduje powstawanie nowych.</li>
					<li>
						<strong>Metoda uœredniaj¹ca losowa</strong>, dzia³a podobnie jak metoda uœredniaj¹ca, ale podzia³ nie jest symetryczny. Rozwa¿my krzy¿owanie jednego genu o dw&oacute;ch wartoœciach, <span style="color:#ff0000;">2</span> oraz <span style="color:#00ff00;">3</span>, w metodzie wymieniaj¹cej dziecko posiada³o gen <span style="color:#ff0000;">2</span> lub <span style="color:#00ff00;">3</span>. W metodzie uœredniaj¹cej zawsze<span style="color:#ee82ee;"> 2.5</span>, natomiast w metodzie uœredniaj¹cej losowej wszystkie wartoœci pomiêdzy <span style="color:#ff0000;">2</span> oraz <span style="color:#00ff00;">3</span>, ³¹cznie z nimi samymi, s¹ mo¿liwe. Algorytm losuje pewien punkt podzia³u z zakresu 0 do 1, kt&oacute;ry okreœla stosunek cech rodzic&oacute;w w kreowaniu cechy dziecka, szczeg&oacute;lnym przypadkiem ten metody jest metoda uœredniaj¹ca, gdzie punkt podzia³u zawsze wynosi 0.5 (po³owa cechy pierwszego rodzica + po³owa cechy drugiego rodzica). Przyk³adowo, dla rodzic&oacute;w z genem o wartoœciach&nbsp;<span style="color: rgb(255, 0, 0);">2</span>&nbsp;oraz&nbsp;<span style="color: rgb(0, 255, 0);">3</span><span style="color:#000000;"> oraz wylosowanym punktem podzia³u 0.3, 30% genu jednego rodzica, oraz 70%&nbsp;genu&nbsp;drugiego rodzica utworzy gen dziecka, tj. (2*0.3+3*0.7)=</span><span style="color:#800080;">2.7</span>, a dla drugiego:&nbsp;(2*0.7+3*0.3)=<span style="color:#800080;">2.3</span>.</li>
				</ul>
			</li>
			<li>
				<strong>Metoda selekcji</strong>, do wyboru s¹ znane z literatury:
				<ul>
					<li>
						<strong>Metoda ko³a ruletki</strong>, czyli selekcja proporcjonalna. Poprzez modyfikacje funkcji przystosowania mo¿emy zmieniaæ nacisk selektywny tej metody. W modyfikacji &quot;min = 0&quot;, od wartoœci przystosowania wszystkich osobnik&oacute;w odejmowana jest wartoœæ przystosowania najs³abszego z nich, czyli za ka¿dym razem, przynajmniej 1 osobnik bêdzie mia³ zerow¹ wartoœæ funkcji przystosowania, jest to spos&oacute;b na zwiêkszenie nacisku selektywnego, szczeg&oacute;lnie wtedy, gdy r&oacute;¿nice pomiêdzy przystosowaniem poszczeg&oacute;lnym osobnik&oacute;w s¹ niewielkie, przyk³adowo, populacja z przystosowaniami {60,62,65,71} po przekszta³ceniu bêdzie wynosiæ odpowiednio {0,2,3,11}. Modyfikacja &quot;pierwiastek&quot; zwyczajnie pierwiastkuje funkcje przystosowania wszystkich osobnik&oacute;w, co znacznie zmniejsza nacisk selektywny.</li>
					<li>
						<strong>Metoda turniejowa</strong>, w kt&oacute;rej liczba turniej&oacute;w zawsze jest r&oacute;wna liczbie osobnik&oacute;w w populacji, natomiast ich wielkoœæ ustala u¿ytkownik.</li>
				</ul>
			</li>
			<li>
				Zaznaczenie opcji sukcesja elitarna spowoduje zapamiêtanie najlepszego osobnika i przywr&oacute;cenie go po u¿yciu operator&oacute;w genetycznych. Oznacza to, ¿e weŸmie on udzia³ w selekcji, reprodukcji oraz mutacji, dostarczaj¹c sw&oacute;j materia³ genetyczny do populacji, ale po ich u¿yciu, jego pierwotna kopia zostanie przywr&oacute;cona do populacji w zamian za jednego z osobnik&oacute;w.</li>
			<li>
				Prawdopodobieñstwo mutacji okreœla jaka jest szansa mutacji ka¿dego z gen&oacute;w.</li>
			<li>
				Dodatkowo, ustawienie niezwi¹zane z samym algorytmem - grawitacja, kt&oacute;ra zachowuje siê analogicznie do grawitacji obserwowanej w ¿yciu codziennym.</li>
		</ul>
	</body>
</html>
